xml/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml/Enums/ОсобенностиУчетаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОсобенностиУчетаНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЛегкаяПромышленность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БезОсобенностейУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml/CommonForms/Марк_ФормаРаботаСGTIN/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТаблицаДляЗаполнения.Область(1,1).Текст = "НомерСтроки";
	ТаблицаДляЗаполнения.Область(1,1).ЦветФона = ЦветаСтиля.ДобавленныйРеквизитФон;
	ТаблицаДляЗаполнения.Область(1,1).ШиринаКолонки = 10;
	ТаблицаДляЗаполнения.Область(1,2).Текст = "Наименование";
	ТаблицаДляЗаполнения.Область(1,2).ЦветФона = ЦветаСтиля.ДобавленныйРеквизитФон;
	ТаблицаДляЗаполнения.Область(1,2).ШиринаКолонки = 25;
	ТаблицаДляЗаполнения.Область(1,3).Текст = "Артикул";
	ТаблицаДляЗаполнения.Область(1,3).ЦветФона = ЦветаСтиля.ДобавленныйРеквизитФон; 
	ТаблицаДляЗаполнения.Область(1,3).ШиринаКолонки = 10;
	ТаблицаДляЗаполнения.Область(1,4).Текст = "Размер";
	ТаблицаДляЗаполнения.Область(1,4).ЦветФона = ЦветаСтиля.ДобавленныйРеквизитФон;
	ТаблицаДляЗаполнения.Область(1,4).ШиринаКолонки = 10;
	ТаблицаДляЗаполнения.Область(1,5).Текст = "GTIN";
	ТаблицаДляЗаполнения.Область(1,5).ЦветФона = ЦветаСтиля.ЦветФонаШапкиОтчета;
	ТаблицаДляЗаполнения.Область(1,5).ШиринаКолонки = 20;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатурыПоСсылке(Характеристика)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Владелец.Наименование КАК Номенклатура,
		|	ХарактеристикиНоменклатуры.Владелец.Артикул КАК Артикул,
		|	ХарактеристикиНоменклатуры.Наименование КАК Характеристика
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	ХарактеристикиНоменклатуры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
    	Результат = Новый Структура;
		РЕзультат.Вставить("Номенклатура", Выборка.Номенклатура);
		Результат.Вставить("Артикул", Выборка.Артикул);
		Размер = "";
		Для Позиция = 1 по СтрДлина(Выборка.характеристика) Цикл
			Симв = Сред(Выборка.характеристика, Позиция, 1);
			Если Симв = "," ИЛИ Симв = "р" Тогда
				Прервать;
			КонецЕсли;
			
			Если Симв >= "0" И Симв <= "9" ИЛИ Симв = "-" Тогда
         		Размер=Размер+Симв;
      		КонецЕсли;
		КонецЦикла;
		Результат.Вставить("Размер", Размер);
	КонецЕсли;
	Возврат Результат;
КонецФункции


&НаКлиенте
Процедура ЗаполнитьGTIN(Команда)
	КоличествоСтрок = ТаблицаДляЗаполнения.ВысотаТаблицы;
	МассивGTIN = Новый Массив;
	Для Строка = 2 По КоличествоСтрок Цикл
		
		СтруктураGTIN = Новый Структура;
		СтруктураGTIN.Вставить("НомерСтроки", Число(ТаблицаДляЗаполнения.Область(Строка,1).Текст));
		КодGTIN = ТаблицаДляЗаполнения.Область(Строка,5).Текст;
		НачальнаяПозиция = СтрНайти(КодGTIN,"29");
		Если НачальнаяПозиция = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КодGTIN = "0" + Сред(КодGTIN, НачальнаяПозиция, 13);
		СтруктураGTIN.Вставить("ШтрихкодGTIN", КодGTIN);
		СтрокаТЧ =  ЭтаФорма.ВладелецФормы.Объект.Товары.НайтиСтроки(Новый Структура("НомерСтроки", СтруктураGTIN.НомерСтроки))[0];
		СтруктураGTIN.Вставить("Номенклатура", СтрокаТЧ.Номенклатура);	
		СтруктураGTIN.Вставить("Характеристика", СтрокаТЧ.Характеристика);
		
		МассивGTIN.Добавить(СтруктураGTIN);
	КонецЦикла;
	
	Если МассивGTIN.Количество() = ЭтаФорма.ВладелецФормы.Объект.Товары.Количество() Тогда
		УстановитьОсобенностиНоменклатуры(МассивGTIN);
		ДобавитьКНоменклатуреКодыGTIN(МассивGTIN);
	Иначе
		Сообщить("ОШИБКА: Количество кодов GTIN не совпадает с количеством строк в документе");	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОсобенностиНоменклатуры(МассивGTIN)
	Для Каждого СтруктураШтрихкод Из МассивGTIN Цикл
		Если СтруктураШтрихкод.Номенклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета Тогда
			ТекНоменклатура = СтруктураШтрихкод.Номенклатура.ПолучитьОбъект();
			ТекНоменклатура.ОсобенностьУчета = Перечисления.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность;
			ТекНоменклатура.ПродукцияМаркируемаяДляГИСМ = Истина;
			ТекНоменклатура.ВидНоменклатуры = Константы.Марк_ВидНоменклатуры.Получить();
			ТекНоменклатура.Записать();
		КонецЕсли;
	КонецЦикла;
	Сообщить("ИНФО: Номенклатура изменена");
КонецПроцедуры


&НаСервере
Процедура ДобавитьКНоменклатуреКодыGTIN(МассивGTIN)
	Для Каждого СтруктураШтрихкод Из МассивGTIN Цикл
		НовЗапись = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
		НовЗапись.Штрихкод 			= СтруктураШтрихкод.ШтрихкодGTIN;
		НовЗапись.Владелец 			= СтруктураШтрихкод.Номенклатура;
		НовЗапись.Характеристика 	= СтруктураШтрихкод.Характеристика;
		НовЗапись.Упаковка			= Справочники.УпаковкиНоменклатуры.ПолучитьУпаковкуПоУмолчанию(СтруктураШтрихкод.Номенклатура);
		НовЗапись.ТипШтрихкода 		= ПланыВидовХарактеристик.ТипыШтрихкодов.ITF14; 
		НовЗапись.Записать(Истина);
	КонецЦикла;
	Сообщить("ИНФО: GTIN добавлены");	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НомерСтрокиТабДок = 1;
	Для каждого Стр Из ЭтаФорма.ВладелецФормы.Объект.Товары Цикл
		НомерСтрокиТабДок = НомерСтрокиТабДок + 1;
		ДанныеНоменклатуры = ПолучитьДанныеНоменклатурыПоСсылке(Стр.Характеристика);
		ТаблицаДляЗаполнения.Область(НомерСтрокиТабДок, 1).Текст = Стр.НомерСтроки;
		ТаблицаДляЗаполнения.Область(НомерСтрокиТабДок, 2).Текст = ДанныеНоменклатуры.Номенклатура;
		ТаблицаДляЗаполнения.Область(НомерСтрокиТабДок, 3).Текст = ДанныеНоменклатуры.Артикул;
		ТаблицаДляЗаполнения.Область(НомерСтрокиТабДок, 4).Текст = ДанныеНоменклатуры.Размер;
	КонецЦикла;
КонецПроцедуры
